data/DUCT/AR_5_Ret_180/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../caseDef"

U_b             #calc "$Re_b*$nu/$h";

Uinlet          ($U_b 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    "(wallTop|wallSide)"
    {
        type            noSlip;
    }

    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }

    "(symmetryBottom|symmetrySide)"
    {
        type            symmetry;
    }

}

// ************************************************************************* //
