data/DUCT/AR_5_Ret_180/0/k_LES
k_LES nonuniform List<scalar>
11045
(
5.20745033874799
5.7098348137131785
6.536363843774994
7.508107017719514
8.546845449163351
9.605960281046013
10.658536411791363
11.696933281894387
...
);
