data/DUCT/AR_5_Ret_180/0/tauij_LES
tauij_LES nonuniform List<symmTensor>
11045
(
(4.7962945734997975 0.3072071570100198 0.008369915946204176 2.7545535952003726 -0.0002320804984919755 2.8640525084297375)
(5.4408864269920025 0.8977016846304059 0.005175337186777628 2.869099249918254 0.0010538312170136617 3.1096839217000904)
(6.49350784419177 1.4419051637563507 0.0037561882152255086 3.0620422078621328 0.002765765593664177 3.51717755623941)
(7.6906905056054455 1.939781602132197 0.0009240817354821346 3.305190798752165 0.001368369696071895 4.020332665605604)
(8.941535780525244 2.3897747857390517 0.0030476085441546825 3.575796254969024 0.000317938310582201 4.576358809708451)
(10.201464993273595 2.7925695538931086 0.010608438625713635 3.8568024239796674 0.003908036194987958 5.153653085228195)
(11.459246494666468 3.154178463753704 0.014734800882652655 4.133577709888657 0.009225835868940683 5.724248560752802)
(12.741457311836044 3.482376268003061 0.01424632477994611 4.395147507818517 0.011848633139705623 6.257261723546855)
...
);
