data/DUCT/AR_5_Ret_180/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
11045
(
(0.0005 4.597582821e-05 4.697944704e-05)
(0.0005 0.0001337478639 4.697944705e-05)
(0.0005 0.0002135406236 4.697944705e-05)
(0.0005 0.000286079496 4.697944704e-05)
(0.0005 0.0003520239256 4.697944704e-05)
(0.0005 0.0004119734069 4.697944705e-05)
(0.0005 0.0004664729354 4.697944704e-05)
(0.0005 0.0005160179614 4.697944704e-05)
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<vector> 
235
(
(0.0005 0.001 4.697944704e-05)
(0.0005 0.001 0.00014006632)
(0.0005 0.001 0.0002314253369)
(0.0005 0.001 0.00032108857)
(0.0005 0.001 0.0004090874958)
(0.0005 0.001 0.0004954530069)
(0.0005 0.001 0.0005802154222)
(0.0005 0.001 0.0006634044981)
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<vector> 
47
(
(0.0005 4.597582821e-05 0.005)
(0.0005 0.0001337478639 0.005)
(0.0005 0.0002135406236 0.005)
(0.0005 0.0002860794961 0.005)
(0.0005 0.0003520239255 0.005)
(0.0005 0.0004119734069 0.005)
(0.0005 0.0004664729355 0.005)
(0.0005 0.0005160179614 0.005)
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
