data/DUCT/AR_5_Ret_180/constant/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
11045
(
4.697944704e-05
4.697944705e-05
4.697944705e-05
4.697944704e-05
4.697944704e-05
4.697944705e-05
4.697944704e-05
4.697944704e-05
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<scalar> 
235
(
4.697944704e-05
0.00014006632
0.0002314253369
0.00032108857
0.0004090874958
0.0004954530069
0.0005802154222
0.0006634044981
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<scalar> 
47
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
